using ItemClassLibrary.Entity;
using ItemClassLibrary.Util;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace AbilityPatternCreater {
    class Program {
        static void Main(string[] args) {
            string settingFile = @"C:\Tools\ability.json";


            List<AbilityPattern> abilityList = new List<AbilityPattern>();

            string[] parts = new string[] { Utility.PARTS_WEAPON_STICK, Utility.PARTS_WEAPON_WAND };
            for(int i = 0; i < Utility.WEAPON_LIST.Length; i++) {
                if(parts.Contains(Utility.WEAPON_LIST[i])) {
                    abilityList.Add(new AbilityPattern(Utility.WEAPON_LIST[i], "",
                        new List<string[]> {
                        new string[]{ "こうげき力+(num)", "2,4,6", "0,1,3,-1|0,1,2,3,-2|0,1,2,3,-3" },
                        new string[]{ "MP吸収ガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                        new string[]{ "おしゃれさ+(num)", "5,10,15", "0,2,3,-4|0,2,3,-9|0,1,2,3,-14" },
                        new string[]{ "MP吸収率+(num)%", "1.0,1.2,1.4", "0,0.2,-0.8|0,0.2,-0.8|0,0.2,0.3,-0.8" },
                        new string[]{ "MP消費しない率+(num)%", "2,4,5", "0,0.5,1,2,-1.8|0,0.5,1,2,-3.6|0,0.5,1,2,-4.4" },
                        new string[]{ "呪文発動速度+(num)%", "2,4,6", "0,1,-2|0,1,-3|0,1,-5" },
                        new string[]{ "呪文ぼうそう率+(num)%", "1,1.2,1.4", "0,0.1,0.2,-0.5|0,0.1,0.2,-0.7|0,0.2,0.3,-0.9" },
                        new string[]{ "かいしん率+(num)%", "1.0,1.2,1.4", "0,0.2,-0.8|0,0.2,-0.8|0,0.2,0.3,-0.8" },
                        new string[]{ "攻撃時(num)%でどく", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%で眠り", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%でマヒ", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%で混乱", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%で幻惑", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%で魅了", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%でマホトーン", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%でヘナトス", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%でルカニ", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%でリホ系解除", "10,20,30", "0,4|0,4|0,4" },
                        new string[]{ "攻撃時(num)%でマホ系解除", "10,20,30", "0,4|0,4|0,4" },
                        new string[]{ "攻撃時(num)%で会心率上昇", "3,6,10", "0,2|0,2|0,2" },
                        }));
                }
                else {
                    abilityList.Add(new AbilityPattern(Utility.WEAPON_LIST[i], "",
                        new List<string[]> {
                        new string[]{ "こうげき力+(num)", "2,4,6", "0,1,3,-1|0,1,2,3,-2|0,1,2,3,-3" },
                        new string[]{ "かいしん率+(num)%", "1.0,1.2,1.4", "0,0.2,-0.8|0,0.2,-0.8|0,0.2,0.3,-0.8" },
                        new string[]{ "おしゃれさ+(num)", "5,10,15", "0,2,3,-4|0,2,3,-9|0,1,2,3,-14" },
                        new string[]{ "攻撃時(num)%でヘナトス", "2,3,4", "0,1,-1|0,1,-2|0,1,-3" },
                        new string[]{ "攻撃時(num)%でルカニ", "2,3,4", "0,1,-1|0,1,-2|0,1,-3" },
                        new string[]{ "呪文発動速度+(num)%", "2,4,6", "0,1|0,1|0,1" },
                        new string[]{ "MP消費しない率+(num)%", "2,4,5", "0,2|0,2|0,2" },
                        new string[]{ "武器ガード率+(num)%", "1,1.2,1.4", "0,0.2|0,0.2|0,0.3"},
                        new string[]{ "呪文ぼうそう率+(num)%", "1,1.2,1.4", "0,0.2|0,0.2|0,0.3" },
                        new string[]{ "攻撃時(num)%でどく", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%で眠り", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%でマヒ", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%で混乱", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%で幻惑", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%で魅了", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%でマホトーン", "2,3,4", "0,1|0,1|0,1" },
                        new string[]{ "攻撃時(num)%でリホ系解除", "10,20,30", "0,4|0,4|0,4" },
                        new string[]{ "攻撃時(num)%でマホ系解除", "10,20,30", "0,4|0,4|0,4" },
                        new string[]{ "攻撃時(num)%で会心率上昇", "3,6,10", "0,2|0,2|0,2" },
                        }));
                }
            }
            abilityList.Add(new AbilityPattern(Utility.PARTS_SHIELD, "",
                new List<string[]> {
                    new string[]{ "盾ガード率+(num)%","1,1.2,1.4", "0,0.1,0.2,-0.5|0,0.1,0.2,-0.7|0,0.2,0.3,-0.8" },
                    new string[]{ "ブレス系ダメージ(num)%減", "6,10", "0,2,-5|0,2,3,4,-9" },
                    new string[]{ "攻撃呪文ダメージ(num)%減", "3,5,7", "0,1,-2|0,1,-4|0,1,-6" },
                    new string[]{ "呪いガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "しばりガード+(num)%", "30,60,90", "0,2,4,6,8,10,-27|0,2,4,6,8,10,-54|0,2,4,6,8,10,-81" },
                    new string[]{ "おびえガード+(num)%", "30,60,90", "0,10|0,10|0,10" },
                    new string[]{ "踊らされガード+(num)%", "30,60,90", "0,10|0,10|0,10" },
                    new string[]{ "転びガード+(num)%", "30,60,90", "0,10|0,10|0,10" },
                    new string[]{ "炎ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "氷ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "風ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "雷ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "土ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "闇ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "光ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
            }));
            abilityList.Add(new AbilityPattern(Utility.PARTS_HEAD, "",
                new List<string[]> {
                    new string[]{ "さいだいHP+(num)", "3,5,7", "0,2,4,-2|0,2,3,4,-3|0,1,2,3,-4" },
                    new string[]{ "さいだいMP+(num)", "5,10,15", "0,2,3,-4|0,2,3,-8|0,1,2,3,-12" },
                    new string[]{ "眠りガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "マヒガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "混乱ガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "封印ガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "幻惑ガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "即死ガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "おびえガード+(num)%", "30,60,90", "0,2,4,6,8,10,-27|0,2,4,6,8,10,-54|0,2,4,6,8,10,-81" },
                    new string[]{ "どくガード+(num)%", "20,40,60", "0,10|0,10|0,10" },
                    new string[]{ "開戦時(num)%でピオラ", "3,6,10", "0,2|0,2|0,2" },
            }));
            abilityList.Add(new AbilityPattern(Utility.PARTS_UPPERBODY, "",
                new List<string[]> {
                    new string[]{ "しゅび力+(num)", "2,4,6", "0,1,3,-1|0,1,2,3,-2|0,1,2,3,-3" },
                    new string[]{ "ブレス系ダメージ(num)%減", "6,10", "0,2,-5|0,2,3,4,-9" },
                    new string[]{ "攻撃呪文ダメージ(num)%減", "3,5,7", "0,1,-2|0,1,-4|0,1,-6" },
                    new string[]{ "こうげき魔力+(num)", "5,10,15", "0,2,3,-4|0,2,3,-8|0,1,2,3,-12" },
                    new string[]{ "かいふく魔力+(num)", "5,10,15", "0,2,3,-4|0,2,3,-8|0,1,2,3,-12" },
                    new string[]{ "呪いガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "即死ガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "おもさ+(num)", "5,10,15", "0,3|0,3|0,3" },
                    new string[]{ "炎ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "氷ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "風ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "雷ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "土ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "闇ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "光ダメージ(num)%減", "6,10,14", "0,2|0,4|0,4" },
                    new string[]{ "開戦時(num)%でスカラ", "3,6,10", "0,2|0,2|0,2" },
            }));
            abilityList.Add(new AbilityPattern(Utility.PARTS_LOWERBODY, "",
                new List<string[]> {
                    new string[]{ "しゅび力+(num)", "2,4,6", "0,1,3,-1|0,1,2,3,-2|0,1,2,3,-3" },
                    new string[]{ "MP吸収ガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "こうげき魔力+(num)", "5,10,15", "0,2,3,-4|0,2,3,-8|0,1,2,3,-12" },
                    new string[]{ "かいふく魔力+(num)", "5,10,15", "0,2,3,-4|0,2,3,-8|0,1,2,3,-12" },
                    new string[]{ "眠りガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "マヒガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "混乱ガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "封印ガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "幻惑ガード+(num)%", "20,40,60", "0,2,4,6,8,10,-15|0,2,4,6,8,10,-30|0,2,4,6,8,10,-45" },
                    new string[]{ "どくガード+(num)%", "20,40,60", "0,10|0,10|0,10" },
                    new string[]{ "開戦時(num)%でマホキテ", "3,6,10", "0,2|0,2|0,2" },
            }));
            abilityList.Add(new AbilityPattern(Utility.PARTS_ARM, "",
                new List<string[]> {
                    new string[]{ "きようさ+(num)",  "5,10,15", "0,2,3,-4|0,2,3,-8|0,1,2,3,-12" },
                    new string[]{ "かいしん率+(num)%", "1.0,1.2,1.4", "0,0.2,-0.8|0,0.2,-0.8|0,0.2,0.3,-0.8" },
                    new string[]{ "MP消費しない率+(num)%", "2,4,5", "0,0.5,1,2,-1.8|0,0.5,1,2,-3.6|0,0.5,1,2,-4.4" },
                    new string[]{ "呪文発動速度+(num)%", "2,4,6", "0,1,-2|0,1,-3|0,1,-5" },
                    new string[]{ "呪文ぼうそう率+(num)%", "1,1.2,1.4", "0,0.1,0.2,-0.5|0,0.1,0.2,-0.7|0,0.2,0.3,-0.9" },
                    new string[]{ "攻撃時(num)%で眠り", "2,3,4", "0,1,-1|0,1,-2|0,1,-3" },
                    new string[]{ "攻撃時(num)%でヘナトス", "2,3,4", "0,1,-1|0,1,-2|0,1,-3" },
                    new string[]{ "攻撃時(num)%でルカニ", "2,3,4", "0,1,-1|0,1,-2|0,1,-3" },
                    new string[]{ "通常ドロップ率(num)倍", "1.2,1.4,1.5", "0,0.4|0,0.4|0,0.4" },
                    new string[]{ "レアドロップ率(num)倍", "1.2,1.4,1.5", "0,0.4|0,0.4|0,0.4" },
                    new string[]{ "攻撃時(num)%でどく", "2,3,4", "0,1|0,1|0,1" },
                    new string[]{ "攻撃時(num)%でマヒ", "2,3,4", "0,1|0,1|0,1" },
                    new string[]{ "攻撃時(num)%で混乱", "2,3,4", "0,1|0,1|0,1" },
                    new string[]{ "攻撃時(num)%で幻惑", "2,3,4", "0,1|0,1|0,1" },
                    new string[]{ "攻撃時(num)%で魅了", "2,3,4", "0,1|0,1|0,1" },
                    new string[]{ "攻撃時(num)%でマホトーン", "2,3,4", "0,1|0,1|0,1" },
            }));
            abilityList.Add(new AbilityPattern(Utility.PARTS_LEG, "",
                new List<string[]> {
                    new string[]{ "おもさ+(num)", "5,10,15", "0,2,3,-4|0,2,3,-7|0,1,2,3,-10" },
                    new string[]{ "すばやさ+(num)",  "5,10,15", "0,2,3,-4|0,2,3,-8|0,1,2,3,-12" },
                    new string[]{ "身かわし率+(num)%", "1.0,1.2,1.4", "0,0.2,-0.8|0,0.2,-0.8|0,0.2,0.3,-0.8" },
                    new string[]{ "おしゃれさ+(num)", "5,10,15", "0,2,3,-4|0,2,3,-9|0,1,2,3,-14" },
                    new string[]{ "踊らされガード+(num)%", "30,60,90", "0,2,4,6,8,10,-27|0,2,4,6,8,10,-54|0,2,4,6,8,10,-81" },
                    new string[]{ "転びガード+(num)%", "30,60,90", "0,2,4,6,8,10,-27|0,2,4,6,8,10,-54|0,2,4,6,8,10,-81" },
                    new string[]{ "不意をつく確率+(num)%", "2,3,4", "0,1|0,1|0,1" },
                    new string[]{ "移動速度+(num)%", "1.0,2.0,3.0", "0,0.2|0,0.2|0,0.2" },
            }));

            abilityList.Add(new AbilityPattern(Utility.PARTS_ACCESSORY_FACE, "魔犬の仮面",
                new List<string[]> {
                    new string[]{ "必殺チャージ時バイキルト", "0", "0" },
                    new string[]{ "必殺チャージ時魔力かくせい", "0", "0" },
                    new string[]{ "必殺チャージ時聖なる祈り", "0", "0" },
                    new string[]{ "必殺チャージ時早詠みの杖", "0", "0" },
                    new string[]{ "必殺チャージ時スカラ2段階", "0", "0" },
                    new string[]{ "必殺チャージ時魔結界2段階", "0", "0" },
                    new string[]{ "必殺チャージ時ピオラ2段階", "0", "0" },
                    new string[]{ "必殺チャージ時心頭滅却", "0", "0" },
                    new string[]{ "必殺チャージ時弓聖の守り星", "0", "0" },
                    new string[]{ "必殺チャージ時ホップスティック", "0", "0" },
                    new string[]{ "必殺チャージ時10%で聖騎士の堅陣", "0", "0" },
            }));
            abilityList.Add(new AbilityPattern(Utility.PARTS_ACCESSORY_FACE, "死神のピアス",
                new List<string[]> {
                    new string[]{ "特技のダメージ+(num)", "5", "0" },
                    new string[]{ "特技の回復量+(num)", "5", "0" },
                    new string[]{ "呪文のダメージ+(num)", "5", "0" },
                    new string[]{ "呪文の回復量+(num)", "5", "0" },
            }));
            abilityList.Add(new AbilityPattern(Utility.PARTS_ACCESSORY_FACE, "機神の眼甲",
                new List<string[]> {
                    new string[]{ "味方死亡時(num)%でためる", "1,2", "0|0" },
                    new string[]{ "味方死亡時(num)%で聖女の守り",  "1,2", "0|0" },
                    new string[]{ "さいだいHP+2", "0", "0" },
            }));

            Utility.WriteAbilityPattern(settingFile, abilityList);

            List<AbilityPattern> DeAbilityList = Utility.ReadAbilityPattern(settingFile);

        }
    }
}
